simulation/airfoil_a/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    walls
    {
	type            omegaWallFunction;
        value           uniform 32;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 1;
        value           uniform 1;
    }

    frontAndBack
    {
	    type            omegaWallFunction;
        value           uniform 32;
    }

    airfoil
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    denticles
    {
        type            omegaWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
